// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "To oprogramowanie musi być zainstalowane na woluminie startowym.";
"ERROR_INSTALL" = "Ten wolumin nie spełnia wymagań dla tego uaktualnienia.";

"Newer_Package_Installed_message" = "Nowsza wersja Chameleona jest już zainstalowana.";
"Intel_Mac_message" = "To oprogramowanie nie może być zainstalowane na tym komputerze.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "Chameleon wymaga trzech podstawowych plików. (mówiąc prosto)
boot0 (Na MBR dysku) odpowiedzialne za ładowanie boot1.
boot1 (Na boot-sektorze partycji) za znalezienie boot2.
boot2 (W gównym katalogu partycji) za ładowanie kernela itp.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Ta opcja Instaluje trzy podstawowe pliki i zapisuje boot0 na pierwszych 440 bajtach MBR tak, aby nie zniszczyć istniejącego kodu Windows. Następnie boot0 szuka boot1h na pierwszej aktywnej partycji.
* Ta metoda instalacji ustawia zaznaczoną partycję jako aktywną.";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Nic";
"noboot_description" = "Nie instaluj Chameleona (Przydatne podczas instalacji tylko komponentów Extra)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Narzędzia";
"Utility_description" = "Opcjonalne pliki przydatne w konfiguracji.";

"PrefPanel_title" = "Panel Preferencji";
"PrefPanel_description" = "Instaluje Panel Preferencji dla Chameleona.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Kopiuje domyślne smbios.plist w /Extra/Configuration.";

"Documentation_title" = "Dokumentacja";
"Documentation_description" = "Dokumentacja dla użytkowania i instalacji ręcznej Chameleona.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opcje Bootowania";
"Options_description" = "Utwórz /Extra/com.apple.Boot.plist i wybierz swoje żądane opcje by kontrolować ustawienia Chameleona.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Ukrywa boot banner Chameleona w GUI.";

"GUI_title" = "GUI=No";
"GUI_description" = "Wyłącza domyślnie włączony Graficzny Interfejs Użytkownika.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Używa oryginalnego logo Apple (szare na białym) w ekranie ładowania, zamiast boot.png.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Wyświetla ekran wyboru partycji od razu, bez pokazywania odliczania.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Włącza cichy tryb uruchamiania (brak komunikatów i potwierdzeń).";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Wstrzymuje proces uruchamiania. Gdy Chameleon zakończy przygotowanie do uruchomienia kernela, będzie czekał na naciśnięcie klawisza zanim go uruchomi. Przydatne z opcją Verbose do wyszukiwania błędów.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "A temporary work around for this breaking RAID booting.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Uruchamia kernela w trybie 32 bitowym zamiast domyślnego 64 bitowego.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Włącza opcję naprawy problemów własności EHCI na niepoprawnych biosach.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Włącza opcję dodania: 'wbudowany' ('built-in') do twoich urządzeń Ethernetowych.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Włącza HPET na chipsetach Intela, dla biosów, które nie zawierają tej opcji.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Ta opcja pozwala obejść złe zrzuty pamięci hibernacji (sleep images).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Wyłącza domyślnie włączoną poprawkę restartu.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Włącza opcję resetu kontrolerów UHCI przed uruchomieniem OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Wyłącza domyślnie włączone rozpoznawanie pamięci RAM.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Próbuje wczytać zrzut pamięci (sleep image) zapisany podczas ostatniej hibernacji.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Nowa - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Nowa metoda generowania _CST C-State przy u≈ºyciu rejestr√≥w SystemIO zamiast FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Odrzuca wbudowane tablice SSDT płyty głównej.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "W≈ÇƒÖcza okre≈õlony stan wydajno≈õci CPU, C2";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "W≈ÇƒÖcza okre≈õlony stan wydajno≈õci CPU, C3";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "W≈ÇƒÖcza okre≈õlony stan wydajno≈õci CPU, C4";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Włącza automatyczne generowanie stanów C-States procesora.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Włącza automatyczne generowanie stanów P-States procesora.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Włącza opcję automatycznego wykrywania GPU NVIDII i umieszczania odpowiednich informacji.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Włącza opcję UseAtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Włącza opcję UseNvidiaROM.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Włącza opcję VBIOS.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Czasem naprawia b≈ÇƒÖd PCI Configuration Failed";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Mniejsza, prosta wersja nowego tematu, domyślnie używana podczas tworzenia wersji Chameleona, który wymaga osadzonych tematów. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Poprzedni domyślny temat Chameleona.";

"Default_title" = "Standard";
"Default_description" = "Nowy domyślny temat Chameleona.";

"Bullet_title" = "Bullet";
"Bullet_description" = "A lovely simple theme by NoSmokingBandit from April 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Rozdzielczość";
"Resolution_description" = "Ustaw rozdzielczość ekranu dla twojego monitora.";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set one keylayout to use, or select 'None' if you don't want to select a keylayout.";

// Themes
"Themes_title" = "Tematy";
"Themes_description" = "Kolekcja przykładowych tematów graficznych.
Więcej tematów znajdziesz na http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
